<template>
   <div>
      <swiper :options="swiperOption" class="swiper">
         <swiper-slide class="text">
            <div>
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
               地中海内，俄军以实际行动对叙利亚政府军表示支持，北海舰队几乎全军出动，开展威慑性演习，划定禁航禁飞区，并且积极公开某些西方势力与当地极端分子沆瀣一气，妄图利用平民捏造“化武袭击”，以得到对叙空袭理由的事实。
            </div>
         </swiper-slide>
      </swiper>
   </div>
</template>

<script>
   import 'swiper/dist/css/swiper.css'
   import {swiper,swiperSlide} from 'vue-awesome-swiper'
   export default {
      data(){
         return{
            swiperOption:{
               // 竖向滚动
               direction:'vertical',
               // 一屏显示的数量
               slidesPerView:'auto',
               freeMode:true,
               //鼠标可控
               mousewheel:true,
            }
         }
      },
      components:{swiper,swiperSlide}
   }
</script>

<style scoped>
.swiper{
   height:300px;
   overflow: hidden;
}
.text{
   font-size: 14px;
   text-align: left;
   padding: 30px;
   height: auto;
   /* 改变盒模型 */
   -webkit-box-sizing: border-box;
   box-sizing: border-box;
}
</style>